Autodesk.Revit.DB.ViewDetailLevel
Detail level of the view
Since:
2013

Autodesk.Revit.DB.ViewDetailLevel.Fine
Fine

Autodesk.Revit.DB.ViewDetailLevel.Medium
Medium

Autodesk.Revit.DB.ViewDetailLevel.Coarse
Coarse

Autodesk.Revit.DB.ViewDetailLevel.Undefined
View does not use Detail Level